class Constants:
    #url страниц для тестов
    HOME_PAGE_URL = 'https://qa-scooter.praktikum-services.ru/'
    FORM_ORDER_URL = 'https://qa-scooter.praktikum-services.ru/order'
    DZEN_REDIRECT_URL = 'https://dzen.ru/?yredirect=true'

    #Ответы на вопросы в выпадающем списке в разделе «Вопросы о важном»
    ANSWER_Q1 = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
    ANSWER_Q2 = 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'
    ANSWER_Q3 = 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'
    ANSWER_Q4 = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
    ANSWER_Q5 = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'
    ANSWER_Q6 = 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'
    ANSWER_Q7 = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'
    ANSWER_Q8 = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'

    #1 набор данных для формы заказа
    NAME1 = 'Екатерина'
    SURNAME1= 'Изосимова'
    ADDRESS1 = 'ул.Коммунистическая 11'
    TELEPHONE1 = '+79178085966'
    COMMENT1 = 'Не звоните в звонок'

    #2 набор данных для формы заказа
    NAME2 = 'Анна'
    SURNAME2= 'Королева'
    ADDRESS2 = 'ул.Карла Маркса 5'
    TELEPHONE2 = '+79178085666'
    COMMENT2 = ''

